# Напишите программу, в которой я ввожу два целостных числа, и если первое число
# больше второго, то программа выведет true, иначе false.
a = int(input("Введите целостное число а "))
b = int(input("Введите целостное число b "))
str = a > b
print (str)