# Напишите программу, в которой я ввожу три целостных чисел a, b и c,
# и если сумма a и b больше c, то программа выведет true, иначе false.
a = int(input("Введите целостное число а "))
b = int(input("Введите целостное число b "))
c = int(input("Введите целостное число c "))
str = a + b > c
print(str)