# Напишите программу, которая сравнивает две строки.
# На вход подается str1 и str2.
# И на выходе мы получаем True или False.
str1 = (input("Введите слово "))
str2 = (input("Введите слово "))
print (str1 == str2)