# Напишите программу, в которой есть константа MULTIPLE_VAL=6.4
# и на вход подается число М. На выходе получаем М*MULTIPLE_VAL и
# все значения сконвертированные в integer, string.
M = (int(input("Введите число M ")))
print(M * 6.4)
print(int(M * 6.4))
print(str(M * 6.4))