# Напишите программу, в которой я ввожу два целостных числа,
# и если первое число больше второго, то программа выведет
# true, иначе false.
a = int(input("Введите число a "))
b = int(input("Введите число b "))
print( a > b)