# Напишите программу, в которой я ввожу число а.
# Если число, а является четным, то программа выведет
# true, иначе false.
a = int(input("Введите число а "))
print(a % 2 == 0)