# Напишите программу, в которой я ввожу три целостных
# чисел а, b, c и если сумма а и b больше с,
# то программа выведет True, иначе False.
a = int(input("Введите число а "))
b = int(input("Введите число b "))
c = int(input("Введите число c "))
print(a + b > c)